---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.ViewSolarstudyCurrentStudyTypeIndex
source: html/fd31e292-d129-3afc-6a7d-4e1a81ae2511.htm
---
# Autodesk.Revit.DB.ParameterTypeId.ViewSolarstudyCurrentStudyTypeIndex Property

"Study type"

## Syntax (C#)
```csharp
public static ForgeTypeId ViewSolarstudyCurrentStudyTypeIndex { get; }
```